run/NACA0021__AoA0_k-omega/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  7
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/																
FoamFile																
{																
    version     2.0;																
    format      ascii;																
    class       dictionary;																
    object      blockMeshDict;																
}																
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

															
scale 1;														
                                                                
geometry																
{																
}	

vertices
(
               															
	                    ( 0.0 0.0 0.0) // 0
   ( 1.0 0.002204999999999961 0.0) // 1
                   ( 1.0 10.0 0.0) // 2
                  ( -10.0 0.0 0.0) // 3
  ( 15.0 0.002204999999999961 0.0) // 4
                  ( 15.0 10.0 0.0) // 5
  ( 1.0 -0.002204999999999961 0.0) // 6
 ( 15.0 -0.002204999999999961 0.0) // 7
                  ( 1.0 -10.0 0.0) // 8
                 ( 15.0 -10.0 0.0) // 9
                   ( 0.0 0.0 1.0) // 10
  ( 1.0 0.002204999999999961 1.0) // 11
                  ( 1.0 10.0 1.0) // 12
                 ( -10.0 0.0 1.0) // 13
 ( 15.0 0.002204999999999961 1.0) // 14
                 ( 15.0 10.0 1.0) // 15
 ( 1.0 -0.002204999999999961 1.0) // 16
( 15.0 -0.002204999999999961 1.0) // 17
                 ( 1.0 -10.0 1.0) // 18
                ( 15.0 -10.0 1.0) // 19 
        );
        
blocks																
(																
	hex	(0 1 2 3 10 11 12 13)	( 500 150 1) simpleGrading (1 1000 1)   //block	0
																													
	hex	(1 4 5 2 11 14 15 12)	( 700 150 1) simpleGrading (15 1000 1)  //block	1														
               											
	hex	(6 7 4 1 16 17 14 11)	( 700 15 1) simpleGrading (15 1 1)      //block	2
																																								
	hex	(8 9 7 6 18 19 17 16)	( 700 150 1) simpleGrading (15 0.001 1) //block	3	
	
	hex	(3 8 6 0 13 18 16 10)	( 500 150 1) simpleGrading (1 0.001 1)  //block	4								
);		

edges																
(																
	arc	2 3	(-7 7 0)									
	arc	12 13	(-7 7 1)
	arc	8 3	(-7 -7 0)									
	arc	18 13	(-7 -7 1)									
																
	spline	0 1													
	(					      

                                         ( 0.0 0.0 0 ) 
 ( 0.00024671981657042874 0.004864014130295969 0 ) 
  ( 0.0009866357836101902 0.009661256071725511 0 ) 
   ( 0.0022190176933925554 0.01438980982111185 0 ) 
    ( 0.003942649333762649 0.01904729753812562 0 ) 
    ( 0.006155829688391956 0.02363089418850039 0 ) 
    ( 0.008856374615475837 0.02813734767873015 0 ) 
    ( 0.012041619003218151 0.03256300423978346 0 ) 
   ( 0.015708419399974638 0.036903838753816406 0 ) 
      ( 0.01985315711646002 0.0411554896584853 0 ) 
     ( 0.02447174179695788 0.04531329800903726 0 ) 
    ( 0.029559615456007327 0.04937235022962767 0 ) 
    ( 0.03511175697658486 0.053327524042926115 0 ) 
     ( 0.04112268706534028 0.05717353703157044 0 ) 
    ( 0.047586473659998074 0.06090499725687838 0 ) 
     ( 0.05449673778358616 0.06451645533976309 0 ) 
     ( 0.06184665983971649 0.06800245739627109 0 ) 
     ( 0.06962898634270315 0.07135759821568143 0 ) 
     ( 0.07783603707587677 0.07457657407268822 0 ) 
     ( 0.08645971267103159 0.07765423457672438 0 ) 
      ( 0.0954915026015235 0.08058563298075001 0 ) 
     ( 0.10492249358113281 0.08336607439850027 0 ) 
     ( 0.11474337836040116 0.08599116141282453 0 ) 
     ( 0.12494446491176331 0.08845683659782462 0 ) 
     ( 0.13551568599440833 0.09075942152339428 0 ) 
      ( 0.1464466090894303 0.09289565186177529 0 ) 
      ( 0.1577264466954656 0.09486270827111197 0 ) 
      ( 0.16934406697465365 0.0966582427898811 0 ) 
     ( 0.18128800473841744 0.09828040053762924 0 ) 
      ( 0.1935464727622202 0.09972783658076857 0 ) 
     ( 0.20610737341813284 0.10099972788634552 0 ) 
     ( 0.21895831061373222 0.10209578035078758 0 ) 
       ( 0.2320866020255476 0.1030162309537372 0 ) 
     ( 0.24547929161498316 0.10376184514831978 0 ) 
      ( 0.2591231624143632 0.10433390965770485 0 ) 
       ( 0.273004749570484 0.10473422090281376 0 ) 
       ( 0.287110353632798 0.10496506933675853 0 ) 
     ( 0.30142605407311807 0.10502922000739585 0 ) 
       ( 0.315937723023497 0.10492988970966141 0 ) 
      ( 0.3306310392187286 0.10467072112361124 0 ) 
       ( 0.345491502129707 0.10425575436193513 0 ) 
      ( 0.3605044462736979 0.10368939637182177 0 ) 
      ( 0.3756550556873999 0.10297638865024243 0 ) 
      ( 0.3909283785485107 0.10212177373889693 0 ) 
     ( 0.40630934193137186 0.10113086096523721 0 ) 
      ( 0.4217827666821252 0.10000919188928285 0 ) 
     ( 0.43733338239870584 0.09876250590258447 0 ) 
      ( 0.4529458425008854 0.09739670640600495 0 ) 
       ( 0.468604739375493 0.09591782796738774 0 ) 
      ( 0.4842946195818704 0.09433200482916569 0 ) 
      ( 0.4999999991025516 0.09264544110011821 0 ) 
      ( 0.5157053786241185 0.09086438292544485 0 ) 
       ( 0.5313952588331522 0.0889950928857963 0 ) 
      ( 0.5470541557121839 0.08704382682963822 0 ) 
      ( 0.5626666158205507 0.08501681329509134 0 ) 
       ( 0.5782172315450762 0.0829202356279966 0 ) 
       ( 0.593690656305524 0.08076021685320685 0 ) 
      ( 0.6090716196998196 0.07854280730679705 0 ) 
      ( 0.6243449425740935 0.07627397498881294 0 ) 
      ( 0.6394955520026742 0.07395959855007815 0 ) 
      ( 0.6545084961632448 0.07160546278318322 0 ) 
      ( 0.6693689590924875 0.06921725644772642 0 ) 
      ( 0.6840622753076503 0.06680057222377954 0 ) 
      ( 0.6985739442796073 0.06436090855592164 0 ) 
      ( 0.7128896447431308 0.06190367312347552 0 ) 
     ( 0.7269952488302514 0.059434187651150126 0 ) 
      ( 0.7408768360127569 0.05695769375840815 0 ) 
      ( 0.7545207068400739 0.05447935953571259 0 ) 
      ( 0.7679133964589709 0.05200428653144302 0 ) 
      ( 0.7810416879017434 0.04953751683469152 0 ) 
       ( 0.7938926251297652 0.0470840399462319 0 ) 
      ( 0.8064535258195331 0.04464879914250525 0 ) 
      ( 0.8187119938785907 0.04223669705518197 0 ) 
     ( 0.8306559316789744 0.039852600211366836 0 ) 
      ( 0.8422735519961111 0.03750134230635588 0 ) 
        ( 0.853553389641386 0.0351877260115172 0 ) 
     ( 0.8644843127769004 0.032916523153760396 0 ) 
     ( 0.8750555339012502 0.030692473139564747 0 ) 
     ( 0.8852566204954886 0.028520279534977593 0 ) 
      ( 0.8950775053187623 0.02640460475268764 0 ) 
      ( 0.9045084963434626 0.02435006283750494 0 ) 
     ( 0.9135402863200868 0.022361210381638616 0 ) 
     ( 0.9221639619623694 0.020442535640345618 0 ) 
     ( 0.9303710127436202 0.018598445956149328 0 ) 
     ( 0.9381533392955854 0.016833253635247614 0 ) 
     ( 0.9455032614015477 0.015151160452334674 0 ) 
     ( 0.9524135255757721 0.013556240989297036 0 ) 
     ( 0.9588773122218202 0.012052425038617991 0 ) 
      ( 0.9648882423626697 0.01064347932340928 0 ) 
     ( 0.9704403839359932 0.009332988802439855 0 ) 
      ( 0.9755282576483886 0.00812433784008132 0 ) 
     ( 0.9801468423827797 0.007020691527553943 0 ) 
     ( 0.9842915801536527 0.006024977443153856 0 ) 
     ( 0.9879583806052372 0.005139868135255159 0 ) 
     ( 0.9911436250481941 0.004367764602913814 0 ) 
    ( 0.9938441700308243 0.0037107810350122243 0 ) 
    ( 0.9960573504412771 0.0031707310503478743 0 ) 
    ( 0.9977809821376927 0.0027491156582184818 0 ) 
     ( 0.9990133641036874 0.002447113132300363 0 ) 
    ( 0.9997532801270506 0.0022655709604501857 0 ) 
                    ( 1.0 0.002204999999999961 0 )  
    )
    spline 10 11
    (
                                         ( 0.0 0.0 1 ) 
 ( 0.00024671981657042874 0.004864014130295969 1 ) 
  ( 0.0009866357836101902 0.009661256071725511 1 ) 
   ( 0.0022190176933925554 0.01438980982111185 1 ) 
    ( 0.003942649333762649 0.01904729753812562 1 ) 
    ( 0.006155829688391956 0.02363089418850039 1 ) 
    ( 0.008856374615475837 0.02813734767873015 1 ) 
    ( 0.012041619003218151 0.03256300423978346 1 ) 
   ( 0.015708419399974638 0.036903838753816406 1 ) 
      ( 0.01985315711646002 0.0411554896584853 1 ) 
     ( 0.02447174179695788 0.04531329800903726 1 ) 
    ( 0.029559615456007327 0.04937235022962767 1 ) 
    ( 0.03511175697658486 0.053327524042926115 1 ) 
     ( 0.04112268706534028 0.05717353703157044 1 ) 
    ( 0.047586473659998074 0.06090499725687838 1 ) 
     ( 0.05449673778358616 0.06451645533976309 1 ) 
     ( 0.06184665983971649 0.06800245739627109 1 ) 
     ( 0.06962898634270315 0.07135759821568143 1 ) 
     ( 0.07783603707587677 0.07457657407268822 1 ) 
     ( 0.08645971267103159 0.07765423457672438 1 ) 
      ( 0.0954915026015235 0.08058563298075001 1 ) 
     ( 0.10492249358113281 0.08336607439850027 1 ) 
     ( 0.11474337836040116 0.08599116141282453 1 ) 
     ( 0.12494446491176331 0.08845683659782462 1 ) 
     ( 0.13551568599440833 0.09075942152339428 1 ) 
      ( 0.1464466090894303 0.09289565186177529 1 ) 
      ( 0.1577264466954656 0.09486270827111197 1 ) 
      ( 0.16934406697465365 0.0966582427898811 1 ) 
     ( 0.18128800473841744 0.09828040053762924 1 ) 
      ( 0.1935464727622202 0.09972783658076857 1 ) 
     ( 0.20610737341813284 0.10099972788634552 1 ) 
     ( 0.21895831061373222 0.10209578035078758 1 ) 
       ( 0.2320866020255476 0.1030162309537372 1 ) 
     ( 0.24547929161498316 0.10376184514831978 1 ) 
      ( 0.2591231624143632 0.10433390965770485 1 ) 
       ( 0.273004749570484 0.10473422090281376 1 ) 
       ( 0.287110353632798 0.10496506933675853 1 ) 
     ( 0.30142605407311807 0.10502922000739585 1 ) 
       ( 0.315937723023497 0.10492988970966141 1 ) 
      ( 0.3306310392187286 0.10467072112361124 1 ) 
       ( 0.345491502129707 0.10425575436193513 1 ) 
      ( 0.3605044462736979 0.10368939637182177 1 ) 
      ( 0.3756550556873999 0.10297638865024243 1 ) 
      ( 0.3909283785485107 0.10212177373889693 1 ) 
     ( 0.40630934193137186 0.10113086096523721 1 ) 
      ( 0.4217827666821252 0.10000919188928285 1 ) 
     ( 0.43733338239870584 0.09876250590258447 1 ) 
      ( 0.4529458425008854 0.09739670640600495 1 ) 
       ( 0.468604739375493 0.09591782796738774 1 ) 
      ( 0.4842946195818704 0.09433200482916569 1 ) 
      ( 0.4999999991025516 0.09264544110011821 1 ) 
      ( 0.5157053786241185 0.09086438292544485 1 ) 
       ( 0.5313952588331522 0.0889950928857963 1 ) 
      ( 0.5470541557121839 0.08704382682963822 1 ) 
      ( 0.5626666158205507 0.08501681329509134 1 ) 
       ( 0.5782172315450762 0.0829202356279966 1 ) 
       ( 0.593690656305524 0.08076021685320685 1 ) 
      ( 0.6090716196998196 0.07854280730679705 1 ) 
      ( 0.6243449425740935 0.07627397498881294 1 ) 
      ( 0.6394955520026742 0.07395959855007815 1 ) 
      ( 0.6545084961632448 0.07160546278318322 1 ) 
      ( 0.6693689590924875 0.06921725644772642 1 ) 
      ( 0.6840622753076503 0.06680057222377954 1 ) 
      ( 0.6985739442796073 0.06436090855592164 1 ) 
      ( 0.7128896447431308 0.06190367312347552 1 ) 
     ( 0.7269952488302514 0.059434187651150126 1 ) 
      ( 0.7408768360127569 0.05695769375840815 1 ) 
      ( 0.7545207068400739 0.05447935953571259 1 ) 
      ( 0.7679133964589709 0.05200428653144302 1 ) 
      ( 0.7810416879017434 0.04953751683469152 1 ) 
       ( 0.7938926251297652 0.0470840399462319 1 ) 
      ( 0.8064535258195331 0.04464879914250525 1 ) 
      ( 0.8187119938785907 0.04223669705518197 1 ) 
     ( 0.8306559316789744 0.039852600211366836 1 ) 
      ( 0.8422735519961111 0.03750134230635588 1 ) 
        ( 0.853553389641386 0.0351877260115172 1 ) 
     ( 0.8644843127769004 0.032916523153760396 1 ) 
     ( 0.8750555339012502 0.030692473139564747 1 ) 
     ( 0.8852566204954886 0.028520279534977593 1 ) 
      ( 0.8950775053187623 0.02640460475268764 1 ) 
      ( 0.9045084963434626 0.02435006283750494 1 ) 
     ( 0.9135402863200868 0.022361210381638616 1 ) 
     ( 0.9221639619623694 0.020442535640345618 1 ) 
     ( 0.9303710127436202 0.018598445956149328 1 ) 
     ( 0.9381533392955854 0.016833253635247614 1 ) 
     ( 0.9455032614015477 0.015151160452334674 1 ) 
     ( 0.9524135255757721 0.013556240989297036 1 ) 
     ( 0.9588773122218202 0.012052425038617991 1 ) 
      ( 0.9648882423626697 0.01064347932340928 1 ) 
     ( 0.9704403839359932 0.009332988802439855 1 ) 
      ( 0.9755282576483886 0.00812433784008132 1 ) 
     ( 0.9801468423827797 0.007020691527553943 1 ) 
     ( 0.9842915801536527 0.006024977443153856 1 ) 
     ( 0.9879583806052372 0.005139868135255159 1 ) 
     ( 0.9911436250481941 0.004367764602913814 1 ) 
    ( 0.9938441700308243 0.0037107810350122243 1 ) 
    ( 0.9960573504412771 0.0031707310503478743 1 ) 
    ( 0.9977809821376927 0.0027491156582184818 1 ) 
     ( 0.9990133641036874 0.002447113132300363 1 ) 
    ( 0.9997532801270506 0.0022655709604501857 1 ) 
                    ( 1.0 0.002204999999999961 1 )  
	)																																																													
	spline	0	6													
	(
                                         ( 0.0 -0.0 0 ) 
 ( 0.00024671981657042874 -0.004864014130295969 0 ) 
  ( 0.0009866357836101902 -0.009661256071725511 0 ) 
   ( 0.0022190176933925554 -0.01438980982111185 0 ) 
    ( 0.003942649333762649 -0.01904729753812562 0 ) 
    ( 0.006155829688391956 -0.02363089418850039 0 ) 
    ( 0.008856374615475837 -0.02813734767873015 0 ) 
    ( 0.012041619003218151 -0.03256300423978346 0 ) 
   ( 0.015708419399974638 -0.036903838753816406 0 ) 
      ( 0.01985315711646002 -0.0411554896584853 0 ) 
     ( 0.02447174179695788 -0.04531329800903726 0 ) 
    ( 0.029559615456007327 -0.04937235022962767 0 ) 
    ( 0.03511175697658486 -0.053327524042926115 0 ) 
     ( 0.04112268706534028 -0.05717353703157044 0 ) 
    ( 0.047586473659998074 -0.06090499725687838 0 ) 
     ( 0.05449673778358616 -0.06451645533976309 0 ) 
     ( 0.06184665983971649 -0.06800245739627109 0 ) 
     ( 0.06962898634270315 -0.07135759821568143 0 ) 
     ( 0.07783603707587677 -0.07457657407268822 0 ) 
     ( 0.08645971267103159 -0.07765423457672438 0 ) 
      ( 0.0954915026015235 -0.08058563298075001 0 ) 
     ( 0.10492249358113281 -0.08336607439850027 0 ) 
     ( 0.11474337836040116 -0.08599116141282453 0 ) 
     ( 0.12494446491176331 -0.08845683659782462 0 ) 
     ( 0.13551568599440833 -0.09075942152339428 0 ) 
      ( 0.1464466090894303 -0.09289565186177529 0 ) 
      ( 0.1577264466954656 -0.09486270827111197 0 ) 
      ( 0.16934406697465365 -0.0966582427898811 0 ) 
     ( 0.18128800473841744 -0.09828040053762924 0 ) 
      ( 0.1935464727622202 -0.09972783658076857 0 ) 
     ( 0.20610737341813284 -0.10099972788634552 0 ) 
     ( 0.21895831061373222 -0.10209578035078758 0 ) 
       ( 0.2320866020255476 -0.1030162309537372 0 ) 
     ( 0.24547929161498316 -0.10376184514831978 0 ) 
      ( 0.2591231624143632 -0.10433390965770485 0 ) 
       ( 0.273004749570484 -0.10473422090281376 0 ) 
       ( 0.287110353632798 -0.10496506933675853 0 ) 
     ( 0.30142605407311807 -0.10502922000739585 0 ) 
       ( 0.315937723023497 -0.10492988970966141 0 ) 
      ( 0.3306310392187286 -0.10467072112361124 0 ) 
       ( 0.345491502129707 -0.10425575436193513 0 ) 
      ( 0.3605044462736979 -0.10368939637182177 0 ) 
      ( 0.3756550556873999 -0.10297638865024243 0 ) 
      ( 0.3909283785485107 -0.10212177373889693 0 ) 
     ( 0.40630934193137186 -0.10113086096523721 0 ) 
      ( 0.4217827666821252 -0.10000919188928285 0 ) 
     ( 0.43733338239870584 -0.09876250590258447 0 ) 
      ( 0.4529458425008854 -0.09739670640600495 0 ) 
       ( 0.468604739375493 -0.09591782796738774 0 ) 
      ( 0.4842946195818704 -0.09433200482916569 0 ) 
      ( 0.4999999991025516 -0.09264544110011821 0 ) 
      ( 0.5157053786241185 -0.09086438292544485 0 ) 
       ( 0.5313952588331522 -0.0889950928857963 0 ) 
      ( 0.5470541557121839 -0.08704382682963822 0 ) 
      ( 0.5626666158205507 -0.08501681329509134 0 ) 
       ( 0.5782172315450762 -0.0829202356279966 0 ) 
       ( 0.593690656305524 -0.08076021685320685 0 ) 
      ( 0.6090716196998196 -0.07854280730679705 0 ) 
      ( 0.6243449425740935 -0.07627397498881294 0 ) 
      ( 0.6394955520026742 -0.07395959855007815 0 ) 
      ( 0.6545084961632448 -0.07160546278318322 0 ) 
      ( 0.6693689590924875 -0.06921725644772642 0 ) 
      ( 0.6840622753076503 -0.06680057222377954 0 ) 
      ( 0.6985739442796073 -0.06436090855592164 0 ) 
      ( 0.7128896447431308 -0.06190367312347552 0 ) 
     ( 0.7269952488302514 -0.059434187651150126 0 ) 
      ( 0.7408768360127569 -0.05695769375840815 0 ) 
      ( 0.7545207068400739 -0.05447935953571259 0 ) 
      ( 0.7679133964589709 -0.05200428653144302 0 ) 
      ( 0.7810416879017434 -0.04953751683469152 0 ) 
       ( 0.7938926251297652 -0.0470840399462319 0 ) 
      ( 0.8064535258195331 -0.04464879914250525 0 ) 
      ( 0.8187119938785907 -0.04223669705518197 0 ) 
     ( 0.8306559316789744 -0.039852600211366836 0 ) 
      ( 0.8422735519961111 -0.03750134230635588 0 ) 
        ( 0.853553389641386 -0.0351877260115172 0 ) 
     ( 0.8644843127769004 -0.032916523153760396 0 ) 
     ( 0.8750555339012502 -0.030692473139564747 0 ) 
     ( 0.8852566204954886 -0.028520279534977593 0 ) 
      ( 0.8950775053187623 -0.02640460475268764 0 ) 
      ( 0.9045084963434626 -0.02435006283750494 0 ) 
     ( 0.9135402863200868 -0.022361210381638616 0 ) 
     ( 0.9221639619623694 -0.020442535640345618 0 ) 
     ( 0.9303710127436202 -0.018598445956149328 0 ) 
     ( 0.9381533392955854 -0.016833253635247614 0 ) 
     ( 0.9455032614015477 -0.015151160452334674 0 ) 
     ( 0.9524135255757721 -0.013556240989297036 0 ) 
     ( 0.9588773122218202 -0.012052425038617991 0 ) 
      ( 0.9648882423626697 -0.01064347932340928 0 ) 
     ( 0.9704403839359932 -0.009332988802439855 0 ) 
      ( 0.9755282576483886 -0.00812433784008132 0 ) 
     ( 0.9801468423827797 -0.007020691527553943 0 ) 
     ( 0.9842915801536527 -0.006024977443153856 0 ) 
     ( 0.9879583806052372 -0.005139868135255159 0 ) 
     ( 0.9911436250481941 -0.004367764602913814 0 ) 
    ( 0.9938441700308243 -0.0037107810350122243 0 ) 
    ( 0.9960573504412771 -0.0031707310503478743 0 ) 
    ( 0.9977809821376927 -0.0027491156582184818 0 ) 
     ( 0.9990133641036874 -0.002447113132300363 0 ) 
    ( 0.9997532801270506 -0.0022655709604501857 0 ) 
                    ( 1.0 -0.002204999999999961 0 )  
    )
    spline 10 16
    (
                                         ( 0.0 -0.0 1 ) 
 ( 0.00024671981657042874 -0.004864014130295969 1 ) 
  ( 0.0009866357836101902 -0.009661256071725511 1 ) 
   ( 0.0022190176933925554 -0.01438980982111185 1 ) 
    ( 0.003942649333762649 -0.01904729753812562 1 ) 
    ( 0.006155829688391956 -0.02363089418850039 1 ) 
    ( 0.008856374615475837 -0.02813734767873015 1 ) 
    ( 0.012041619003218151 -0.03256300423978346 1 ) 
   ( 0.015708419399974638 -0.036903838753816406 1 ) 
      ( 0.01985315711646002 -0.0411554896584853 1 ) 
     ( 0.02447174179695788 -0.04531329800903726 1 ) 
    ( 0.029559615456007327 -0.04937235022962767 1 ) 
    ( 0.03511175697658486 -0.053327524042926115 1 ) 
     ( 0.04112268706534028 -0.05717353703157044 1 ) 
    ( 0.047586473659998074 -0.06090499725687838 1 ) 
     ( 0.05449673778358616 -0.06451645533976309 1 ) 
     ( 0.06184665983971649 -0.06800245739627109 1 ) 
     ( 0.06962898634270315 -0.07135759821568143 1 ) 
     ( 0.07783603707587677 -0.07457657407268822 1 ) 
     ( 0.08645971267103159 -0.07765423457672438 1 ) 
      ( 0.0954915026015235 -0.08058563298075001 1 ) 
     ( 0.10492249358113281 -0.08336607439850027 1 ) 
     ( 0.11474337836040116 -0.08599116141282453 1 ) 
     ( 0.12494446491176331 -0.08845683659782462 1 ) 
     ( 0.13551568599440833 -0.09075942152339428 1 ) 
      ( 0.1464466090894303 -0.09289565186177529 1 ) 
      ( 0.1577264466954656 -0.09486270827111197 1 ) 
      ( 0.16934406697465365 -0.0966582427898811 1 ) 
     ( 0.18128800473841744 -0.09828040053762924 1 ) 
      ( 0.1935464727622202 -0.09972783658076857 1 ) 
     ( 0.20610737341813284 -0.10099972788634552 1 ) 
     ( 0.21895831061373222 -0.10209578035078758 1 ) 
       ( 0.2320866020255476 -0.1030162309537372 1 ) 
     ( 0.24547929161498316 -0.10376184514831978 1 ) 
      ( 0.2591231624143632 -0.10433390965770485 1 ) 
       ( 0.273004749570484 -0.10473422090281376 1 ) 
       ( 0.287110353632798 -0.10496506933675853 1 ) 
     ( 0.30142605407311807 -0.10502922000739585 1 ) 
       ( 0.315937723023497 -0.10492988970966141 1 ) 
      ( 0.3306310392187286 -0.10467072112361124 1 ) 
       ( 0.345491502129707 -0.10425575436193513 1 ) 
      ( 0.3605044462736979 -0.10368939637182177 1 ) 
      ( 0.3756550556873999 -0.10297638865024243 1 ) 
      ( 0.3909283785485107 -0.10212177373889693 1 ) 
     ( 0.40630934193137186 -0.10113086096523721 1 ) 
      ( 0.4217827666821252 -0.10000919188928285 1 ) 
     ( 0.43733338239870584 -0.09876250590258447 1 ) 
      ( 0.4529458425008854 -0.09739670640600495 1 ) 
       ( 0.468604739375493 -0.09591782796738774 1 ) 
      ( 0.4842946195818704 -0.09433200482916569 1 ) 
      ( 0.4999999991025516 -0.09264544110011821 1 ) 
      ( 0.5157053786241185 -0.09086438292544485 1 ) 
       ( 0.5313952588331522 -0.0889950928857963 1 ) 
      ( 0.5470541557121839 -0.08704382682963822 1 ) 
      ( 0.5626666158205507 -0.08501681329509134 1 ) 
       ( 0.5782172315450762 -0.0829202356279966 1 ) 
       ( 0.593690656305524 -0.08076021685320685 1 ) 
      ( 0.6090716196998196 -0.07854280730679705 1 ) 
      ( 0.6243449425740935 -0.07627397498881294 1 ) 
      ( 0.6394955520026742 -0.07395959855007815 1 ) 
      ( 0.6545084961632448 -0.07160546278318322 1 ) 
      ( 0.6693689590924875 -0.06921725644772642 1 ) 
      ( 0.6840622753076503 -0.06680057222377954 1 ) 
      ( 0.6985739442796073 -0.06436090855592164 1 ) 
      ( 0.7128896447431308 -0.06190367312347552 1 ) 
     ( 0.7269952488302514 -0.059434187651150126 1 ) 
      ( 0.7408768360127569 -0.05695769375840815 1 ) 
      ( 0.7545207068400739 -0.05447935953571259 1 ) 
      ( 0.7679133964589709 -0.05200428653144302 1 ) 
      ( 0.7810416879017434 -0.04953751683469152 1 ) 
       ( 0.7938926251297652 -0.0470840399462319 1 ) 
      ( 0.8064535258195331 -0.04464879914250525 1 ) 
      ( 0.8187119938785907 -0.04223669705518197 1 ) 
     ( 0.8306559316789744 -0.039852600211366836 1 ) 
      ( 0.8422735519961111 -0.03750134230635588 1 ) 
        ( 0.853553389641386 -0.0351877260115172 1 ) 
     ( 0.8644843127769004 -0.032916523153760396 1 ) 
     ( 0.8750555339012502 -0.030692473139564747 1 ) 
     ( 0.8852566204954886 -0.028520279534977593 1 ) 
      ( 0.8950775053187623 -0.02640460475268764 1 ) 
      ( 0.9045084963434626 -0.02435006283750494 1 ) 
     ( 0.9135402863200868 -0.022361210381638616 1 ) 
     ( 0.9221639619623694 -0.020442535640345618 1 ) 
     ( 0.9303710127436202 -0.018598445956149328 1 ) 
     ( 0.9381533392955854 -0.016833253635247614 1 ) 
     ( 0.9455032614015477 -0.015151160452334674 1 ) 
     ( 0.9524135255757721 -0.013556240989297036 1 ) 
     ( 0.9588773122218202 -0.012052425038617991 1 ) 
      ( 0.9648882423626697 -0.01064347932340928 1 ) 
     ( 0.9704403839359932 -0.009332988802439855 1 ) 
      ( 0.9755282576483886 -0.00812433784008132 1 ) 
     ( 0.9801468423827797 -0.007020691527553943 1 ) 
     ( 0.9842915801536527 -0.006024977443153856 1 ) 
     ( 0.9879583806052372 -0.005139868135255159 1 ) 
     ( 0.9911436250481941 -0.004367764602913814 1 ) 
    ( 0.9938441700308243 -0.0037107810350122243 1 ) 
    ( 0.9960573504412771 -0.0031707310503478743 1 ) 
    ( 0.9977809821376927 -0.0027491156582184818 1 ) 
     ( 0.9990133641036874 -0.002447113132300363 1 ) 
    ( 0.9997532801270506 -0.0022655709604501857 1 ) 
                    ( 1.0 -0.002204999999999961 1 )  
							
    )															
                                                                    
                                                                    
    );																
                                                                    
    faces																
    (																
                                                                    
    );																
                                                                    
    faces																
    (																
                                                                    
    );																
                                                                    
                                                                    
    defaultPatch																
    {																
        name frontAndBack;																
        type empty;																
    }		
                                                                                                                                
    boundary																
    (																
        inlet              																
            {																
            type patch;    																
            faces																
            (																
                (3 13 12 2)
                (8 18 13 3)
                (5 2 12 15)
                (8 9 19 18)															
            );																
            } 
        outlet              																
            {																
            type patch;    																
            faces																
            (																
                (4 5 15 14)
                (7 4 14 17)
                (7 17 19 9)  															
            );																
            }	

        foil              																
            {																
            type wall;    																
            faces																
            (																
                (0 1 11 10)
                (0 6 16 10)
                (6 1 11 16)															
            );																
            }	
                                                                
                                                                        
    );	
    // ************************************************************************* //																
                                                                    			               	
    